---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DuctRoughness
source: html/3b1dbbec-3069-f635-a43e-e94c2863ef6f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DuctRoughness Property

"Roughness"

## Syntax (C#)
```csharp
public static ForgeTypeId DuctRoughness { get; }
```